package com.mystudy.scanner2_caffe;

/* 카페만들기
 음료의 종류
 1. 아메리카노(3000) 2.카페라떼(3500) 3.카페모카(4000) 4.과일주스(5000) 0.종료
 // 입력값 : 메뉴번호, 주문수량, 입금액(고객이 낸 돈)
 // 출력값 : 입금액, 판매액(단가*수량), 잔액(입금액 - 판매액)
 //-----------------------------------------------
 <메뉴>
 1. 아메리카노(3000) 2.카페라떼(3500) 3.카페모카(4000) 4.과일주스(5000)
 >메뉴를 선택하세요(1~4) : 1
 >주문수량 : 3
 >입금액 : 10000             // 입력
 =========================
 입금액 : 10000
 판매액 : 9000
 잔액 : 1000 
 */
public class CaffeMain {

	public static void main(String[] args) {
//		MyCaffe caffe = new MyCaffe();
//		caffe.caffeOpen();
		
		new MyCaffe().caffeOpen();
	}

}
